app/Controllers/Admin.php

SELECT `user_id`, `username`, `email`, `created_at`, `updated_at`
FROM `users`
SELECT `privilege_id`, `user_id`, `admin`
FROM `privileges`
---
    public function users()
    {
        $usersModel = new UsersModel;
        $privilegesModel = new PrivilegesModel;

        $users = $usersModel->select(['user_id','username','email','created_at','updated_at'])->findall();
        $privilegesUsers = $privilegesModel->select(['privilege_id','user_id','admin'])->findAll();

SELECT `user_id`, `username`, `email`, `created_at`, `updated_at`
FROM `users`
WHERE `username` = 'test'
 LIMIT 1
SELECT `editable`
FROM `privileges`
WHERE `user_id` = '2'
 LIMIT 1
---
    public function showUsers($username = null)
    {
        $usersModel = new UsersModel;
        $privilegesModel = new PrivilegesModel;
        $user = $usersModel->select(['user_id','username','email','created_at','updated_at'])->where('username', $username)->first();
        $editablePrivileges = $privilegesModel->select(['editable'])->where('user_id',$user['user_id'])->first()['editable'];

SELECT `user_id`
FROM `users`
WHERE `username` = 'test'
 LIMIT 1
SELECT `admin`
FROM `privileges`
WHERE `user_id` = '2'
 LIMIT 1
SELECT `admin`
FROM `privileges`
WHERE `user_id` = '1'
 LIMIT 1
SELECT `editable`
FROM `privileges`
WHERE `user_id` = '2'
 LIMIT 1
---
    public function showUserPrivileges($username = null)
    {
        $usersModel = new UsersModel;
        $privilegesModel = new PrivilegesModel;
        $userId = $usersModel->select(['user_id'])->where('username', $username)->first()['user_id'];
        $searchedPrivileges = $privilegesModel->select(['admin'])->where('user_id', $userId)->first();
        $privileges = $privilegesModel->select(['admin'])->where('user_id',session()->get('user_id'))->first();

        $data = [
            'username'=>$username,
            'user_id'=>$userId,
            'searchedPrivileges'=>$searchedPrivileges,
            'privileges'=>$privileges,
            'editable'=>$privilegesModel->select(['editable'])->where('user_id',$userId)->first()['editable'],

SELECT `user_id`
FROM `users`
WHERE `username` = 'test'
 LIMIT 1
SELECT `admin`
FROM `privileges`
WHERE `user_id` = '2'
 LIMIT 1
SELECT `privilege_id`
FROM `privileges`
WHERE `user_id` = '2'
 LIMIT 1
UPDATE `privileges` SET `admin` = '0'
WHERE `privileges`.`privilege_id` IN ('2')
SELECT `admin`
FROM `privileges`
WHERE `privilege_id` = '1'
 LIMIT 1
SELECT `editable`
FROM `privileges`
WHERE `user_id` = '2'
 LIMIT 1
---
    public function submitUserPrivileges($username = null)
    {
        $privilegesModel = new PrivilegesModel;
        $usersModel = new UsersModel;
        $userId = $usersModel->select(['user_id'])->where('username', $username)->first()['user_id'];
        $savedPrivileges = $privilegesModel->select(['admin'])->where('user_id', $userId)->first();
        $privilegeId = $privilegesModel->select(['privilege_id'])->where('user_id', $userId)->first()['privilege_id'];

        $data = [
            'admin' => is_null($this->request->getVar('admin')) ? "0" : "1",
        ];

        $updatedData = [];
        foreach ($data as $privilege => $value) {
            if($savedPrivileges[$privilege]!=$value){
                $updatedData[$privilege] = $value;
            }
        }
        if(count($updatedData)!=0){
            $privilegesModel->update($privilegeId, $updatedData);
        }

        $returnData = [
            'username'=>$username,
            'user_id'=>$userId,
            'searchedPrivileges'=>$privilegesModel->select(['admin'])->where('user_id', $userId)->first(),
            'privileges'=>$privilegesModel->select(['admin'])->where('privilege_id', session()->get('privilege_id'))->first(),
            'editable'=>$privilegesModel->select(['editable'])->where('user_id',$userId)->first()['editable'],