app/Controllers/Sites.php

    public function index()
    {
        $sitesModel = new SitesModel;
        $sites = $sitesModel->select(['site_id', 'site_name', 'site_link'])->findAll();
---
SELECT `site_id`, `site_name`, `site_link`
FROM `sites`