app/Views/layout.php

SELECT *
FROM `privileges`
WHERE `privilege_id` = '1'
 LIMIT 1
---
if(isset($_SESSION['isLoggedIn'])){
    $loggedIn = True;
    $privilegesModel = new PrivilegesModel();
    $user_privileges = $privilegesModel->where('privilege_id', session('privilege_id'))->first();